#!/usr/bin/python3
# coding=utf-8

import re


import re
from random import choice


#s = '我来到[@1999年#STW*]的[@上海#NUM*]的[@东华大学#PER*]二[@11年#STW*]华华[@上华#NUM*]'

apf = ['@留生打熟#APF*','@知已知彼，百战不殆#APF*','@拆对不拆搭#APF*','@早胜晚败#APF*','@不入虎穴，焉得虎子#APF*','@金玉其外，败絮其中#APF*','@戒剩单骑#APF*','@不吃第三搭#APF*','@小番小和#APF*','@早听早和#APF*','@小和不舍一返三#APF*','@大番一和胜十小，小和不舍一返三#APF*','@隔巡如生张#APF*','@螳螂捕蝉，黄雀在后#APF*','@跳出胜负圈#APF*','@头张牌不吃#APF*','@乱牌忌吃碰#APF*','@牌从前面过，不如摸一个#APF*','@吃碰一张胜摸三巡#APF*','@病牌不乱舍#APF*','@好牌先打#APF*','@杠牌须三思#APF*','@先打幺，后打缺#APF*','@先打风，后打将#APF*','@先拆对，后拆搭#APF*','@打熟张，不打生张#APF*','@留生宁拆搭#APF*','@连四拆熟头#APF*','@有局求大，无局求快#APF*','@今日虽败，尚有明日#APF*','@大番一和胜十小，小和不舍一返三#APF*','@以和为贵#APF*','@有和就和#APF*','@付付求和，败可立见#APF*','@起手六单张牌，决心跳出胜负圈#APF*','@起手三张单风箭，牌势受阻难求和#APF*','@坐庄不做牌#APF*','@控大和，放小和#APF*','@金三银七#APF*','@一条线#APF*','@我不知不扣，我若知则扣#APF*','@声东击西#APF*','@暗埋伏兵#APF*','@守株待兔#APF*','@欲胜必慎切，用心观敌情#APF*','@探敌释疑#APF*','@扣牌不到底#APF*','@牌从窄出#APF*','@对倒不如嵌#APF*','@有去无回#APF*','@牌脚越长越好打#APF*','@12张落地，必钓尖张#APF*','@不吃第三搭#APF*','@牌技知通，牌势如风#APF*','@简听技巧#APF*']
mjs = ['@大四喜#MJS*','@大三元#MJS*','@绿一色#MJS*','@九莲宝灯#MJS*','@四杠#MJS*','@连七对#MJS*','@十三幺#MJS*','@清九幺#MJS*','@小四喜#MJS*','@小三元#MJS*','@字一色#MJS*','@四暗刻#MJS*','@一色双龙会#MJS*','@一色四同顺#MJS*','@一色四节高#MJS*','@一色四步高#MJS*','@三杠#MJS*','@七对#MJS*','@七星不靠#MJS*','@全双刻#MJS*','@清一色#MJS*','@一色三同顺#MJS*','@一色三节高#MJS*','@全大#MJS*','@全中#MJS*','@全小#MJS*','@清龙#MJS*','@三色双龙会#MJS*','@一色三不高#MJS*','@全带五#MJS*','@三同刻#MJS*','@三暗刻#MJS*','@全不靠#MJS*','@组合龙#MJS*','@大于五#MJS*','@小于五#MJS*','@三风刻#MJS*','@花龙#MJS*','@推不倒#MJS*','@三色三同顺#MJS*','@三色三节色高#MJS*','@无番和#MJS*','@妙手回春#MJS*','@海底捞月#MJS*','@杠上开花#MJS*','@抢杠和#MJS*','@碰碰和#MJS*','@混一色#MJS*','@三色三步高#MJS*','@五门齐#MJS*','@全求人#MJS*','@双暗杠#MJS*','@双箭刻#MJS*','@全带幺#MJS*','@不求人#MJS*','@双明杠#MJS*','@和绝张#MJS*','@箭刻#MJS*','@圈风刻#MJS*','@门风刻#MJS*','@门前清#MJS*','@平和#MJS*','@四归一#MJS*','@双同刻#MJS*','@双暗刻#MJS*','@暗杠#MJS*','@断幺#MJS*','@一般高#MJS*','@喜相逢#MJS*','@连六#MJS*','@老少副#MJS*','@幺九刻#MJS*','@明杠#MJS*','@缺一门#MJS*','@无字#MJS*','@边张#MJS*','@坎张#MJS*','@单钓将#MJS*','@自摸#MJS*','@花牌#MJS*','@双东风#MJS*']
num = ['@9种#NUM*','@4张#NUM*','@36张#NUM*','@27种#NUM*','@108张#NUM*','@7种#NUM*','@8张#NUM*','@12张#NUM*','@6种#NUM*','@24张#NUM*','@136张#NUM*','@16张#NUM*','@四道#NUM*','@两张#NUM*','@一张#NUM*','@两种#NUM*','@81种#NUM*','@一百多种#NUM*','@五组#NUM*','@两组#NUM*','@一组#NUM*','@一个#NUM*','@一对#NUM*','@10张#NUM*','@13张#NUM*','@5分#NUM*','@10分#NUM*','@20分#NUM*','@30分#NUM*','@40分#NUM*','@50分#NUM*','@60分#NUM*','@7种#NUM*','@两副#NUM*','@一种#NUM*','@最后一张#NUM*','@另一种#NUM*','@两个#NUM*','@4副#NUM*','@3副#NUM*','@一局#NUM*','@第一圈#NUM*','@第二圈#NUM*','@第三圈#NUM*','@第四圈#NUM*','@2分#NUM*','@3分#NUM*','@11分#NUM*','@几张#NUM*','@几番#NUM*','@一搭#NUM*','@3番#NUM*','@一番#NUM*','@两番#NUM*','@两颗#NUM*','@三番#NUM*','@满贯#NUM*','@一圈#NUM*','@一盘#NUM*','@5种#NUM*','@19张#NUM*','@六张#NUM*','@一组#NUM*','@三个#NUM*','@三副#NUM*','@四组#NUM*','@四番#NUM*','@六副#NUM*','@六番#NUM*','@起和分#NUM*','@8分#NUM*','@底分#NUM*','@基本分#NUM*','@罚分#NUM*','@一副#NUM*','@十二张#NUM*','@3对#NUM*','@24分#NUM*','@七个#NUM*']

per = ['@别人#PER*','@一家#PER*','@自己#PER*','@庄家#PER*','@闲家#PER*','@另外三方#PER*','@三家#PER*','@参赛者#PER*','@一家#PER*','@那家#PER*','@四家#PER*','@几家#PER*','@未和牌者#PER*','@这家#PER*','@裁判#PER*','@某家#PER*','@杠牌这家#PER*','@本家#PER*','@任何一家#PER*','@东者#PER*','@旁家#PER*','@和牌者#PER*','@南家#PER*','@我们#PER*','@上家#PER*','@下家#PER*','@对家#PER*','@西家#PER*','@东家#PER*','@北家#PER*','@甲家#PER*','@乙家#PER*','@各家#PER*','@有人#PER*','@对门#PER*','@上家#PER*','@人们#PER*','@甲#PER*','@乙#PER*','@丙#PER*','@丁#PER*','@他人#PER*','@玩牌者#PER*','@每人#PER*','@错杠者#PER*','@上过牌桌的人#PER*','@娱乐者#PER*','@高手#PER*','@第三家#PER*']
stw = ['@定庄#STW*','@开牌#STW*','@放炮#STW*','@洗牌#STW*','@码牌#STW*','@砌牌#STW*','@起牌#STW*','@摸牌#STW*','@进张#STW*','@摸#STW*','@吃#STW*','@碰#STW*','@杠#STW*','@舍牌#STW*','@打牌#STW*','@出牌#STW*','@吃牌#STW*','@碰牌#STW*','@自摸#STW*','@一入听#STW*','@二入听#STW*','@三入听#STW*','@四入听#STW*','@五入听#STW*','@六入听#STW*','@八入听#STW*','@听牌#STW*','@下叫#STW*','@入听#STW*','@吃牌#STW*','@碰牌#STW*','@和牌#STW*','@点炮和#STW*','@自摸和#STW*','@放炮#STW*','@相公#STW*','@上家和#STW*','@包牌#STW*','@罚分#STW*','@黄牌#STW*','@起牌#STW*','@换牌#STW*','@偷牌#STW*','@藏牌#STW*','@夹带#STW*','@荒牌#STW*','@序数相连#STW*','@依次递增一位数#STW*','@依次递增两位数#STW*','@双数#STW*','@1-9相连接#STW*','@序数相同#STW*','@1-9#STW*','@成和#STW*','@补花#STW*','@本门风#STW*','@开杠#STW*','@进牌#STW*','@吃进#STW*','@多门听#STW*','@不吃#STW*','@不碰#STW*','@东风圈#STW*','@圈风#STW*','@南风圈#STW*','@西风圈#STW*','@北风圈#STW*','@搬庄#STW*','@小和#STW*','@听吃#STW*','@听碰#STW*','@假碰#STW*','@真碰#STW*','@单钓#STW*','@错吃#STW*','@错碰#STW*','@中期阶段#STW*','@后期阶段#STW*','@前期阶段#STW*','@起手牌整理阶段#STW*','@漏吃#STW*','@漏碰#STW*','@扫底#STW*','@减番求和#STW*','@不和牌#STW*','@不放炮#STW*','@听和#STW*','@未下叫#STW*','@牌局前期#STW*','@拆舍#STW*','@多听#STW*','@独听#STW*','@双听#STW*','@减少#STW*','@转听#STW*','@听六张#STW*','@同一花色#STW*','@双钓将#STW*','@作将#STW*','@作对#STW*','@单缺#STW*','@张张可和#STW*','@进1筒#STW*','@进2筒#STW*','@进3筒#STW*','@进4筒#STW*','@进5筒#STW*','@进6筒#STW*','@进7筒#STW*','@进8筒#STW*','@进9筒#STW*','@组番#STW*','@报番#STW*','@失分#STW*','@诈和#STW*','@听张#STW*','@和#STW*','@抓牌#STW*','@抓进#STW*','@打#STW*','@碰和#STW*','@听#STW*','@停牌#STW*','@理牌#STW*','@配牌#STW*','@对顶#STW*']
brt = ['@数牌#BRT*','@筒子#BRT*','@条子#BRT*','@万字#BRT*','@字牌#BRT*','@三元牌#BRT*','@箭牌#BRT*','@中张牌#BRT*','@尖张牌#BRT*','@幺九牌#BRT*','@四风牌#BRT*','@嵌搭#BRT*','@生张#BRT*','@安全牌#BRT*','@杠牌#BRT*','@明杠#BRT*','@对子#BRT*','@搭子#BRT*','@麻将搭子#BRT*','@风刻#BRT*','@刻子#BRT*','@将#BRT*','@将牌#BRT*','@暗刻#BRT*','@顺子#BRT*','@序数牌#BRT*','@花牌#BRT*','@风牌#BRT*','@风刻#BRT*','@圈风#BRT*','@筒#BRT*','@条#BRT*','@万#BRT*','@5567和6#BRT*','@面子#BRT*','@朋组#BRT*','@一般麻将搭子#BRT*','@坎子#BRT*','@一坎#BRT*','@边搭#BRT*','@单中张#BRT*','@特殊搭子#BRT*','@大肚塔子#BRT*','@暴肚子#BRT*','@双足搭子#BRT*','@双头搭子#BRT*','@连四塔子#BRT*','@三拖一搭子#BRT*','@前拖#BRT*','@后拖#BRT*','@散拖#BRT*','@七八八九筒#BRT*','@五六六七万#BRT*','@二二三四条#BRT*','@五六七七筒#BRT*','@五六七八条#BRT*','@三三三四万#BRT*','@熟张#BRT*','@二二四万#BRT*','@六七七八万#BRT*','@其他搭子#BRT*','@二三四万#BRT*','@连五塔子#BRT*','@连七塔子#BRT*','@二三四五六筒#BRT*','@二三四五六七八万#BRT*','@三四五六万#BRT*','@单风箭#BRT*','@一二三四五筒#BRT*','@一条线牌#BRT*','@一路熟牌#BRT*','@二三四五六万#BRT*','@一、二、三、四#BRT*','@八听八财#BRT*','@23468条#BRT*','@789#BRT*','@456#BRT*','@123#BRT*','@2、4、6、8#BRT*','@147、258、369#BRT*','@1234589筒#BRT*','@12345#BRT*','@4556#BRT*','@45567#BRT*','@11、123,123、123、123#BRT*','@11、123、123、123、111#BRT*','@11、123、123、111、111#BRT*','@11、123、111、111、111#BRT*','@11、111、111、111、111#BRT*','@11、11、11、11、11、11、11#BRT*','@1、1、1、1、1、1、1、1、1、1、1、1、11#BRT*','@1、1、1、1、1、1、1、1、1、1、1、1、1、1#BRT*','@单张#BRT*','@杠子#BRT*','@麻将头#BRT*','@将头#BRT*','@一、三#BRT*','@二八张子#BRT*','@七、九#BRT*','@二、八张子#BRT*','@123万#BRT*','@789万#BRT*','@555万#BRT*','@123条#BRT*','@789条#BRT*','@123筒#BRT*','@789筒#BRT*','@55筒#BRT*','@123456789条#BRT*','@33条#BRT*','@222万#BRT*','@333筒#BRT*','@444条#BRT*','@11条#BRT*','@234筒#BRT*','@面子牌#BRT*','@单丁荡张#BRT*','@对嵌#BRT*','@嵌对嵌#BRT*','@废牌#BRT*','@5678筒#BRT*','@尸牌#BRT*','@危险牌#BRT*','@就子#BRT*','@124条#BRT*','@复合面子#BRT*','@客风牌#BRT*','@34万#BRT*','@四连顺#BRT*','@四连顺子#BRT*','@2345万#BRT*','@56万#BRT*','@厉害牌#BRT*','@荡张#BRT*','@闲张#BRT*','@停张牌#BRT*','@34条#BRT*','@45万#BRT*','@箭#BRT*','@风#BRT*','@25条#BRT*','@124579条#BRT*','@279万#BRT*','@13456万#BRT*','@3556万#BRT*','@224条#BRT*','@668万#BRT*','@生张#BRT*','@677万#BRT*','@98875筒#BRT*','@456条#BRT*','@39条#BRT*','@123789万#BRT*','@3899条#BRT*','@334455万#BRT*','@2233筒#BRT*','@不动牌#BRT*','@1234589筒#BRT*','@245689条#BRT*']
brn = ['@中#BRN*','@发#BRN*','@白#BRN*','@听用#BRN*','@东#BRN*','@南#BRN*','@西#BRN*','@北#BRN*','@一万#BRN*','@二万#BRN*','@三万#BRN*','@四万#BRN*','@五万#BRN*','@六万#BRN*','@七万#BRN*','@八万#BRN*','@九万#BRN*','@一条#BRN*','@二筒#BRN*','@三筒#BRN*','@四筒#BRN*','@五筒#BRN*','@六筒#BRN*','@七筒#BRN*','@八筒#BRN*','@九筒#BRN*','@一筒#BRN*','@二条#BRN*','@三条#BRN*','@四条#BRN*','@五条#BRN*','@六条#BRN*','@七条#BRN*','@八条#BRN*','@九条#BRN*','@边张#BRN*','@嵌张#BRN*','@打出的牌#BRN*','@所需要的牌#BRN*','@自摸牌#BRN*','@一#BRN*','@二#BRN*','@三#BRN*','@四#BRN*','@五#BRN*','@六#BRN*','@七#BRN*','@八#BRN*','@九#BRN*','@1#BRN*','@2#BRN*','@3#BRN*','@4#BRN*','@5#BRN*','@6#BRN*','@7#BRN*','@8#BRN*','@9#BRN*','@幺牌#BRN*','@九牌#BRN*','@特定牌#BRN*','@单张#BRN*','@对倒#BRN*','@南风#BRN*','@西风#BRN*','@北风#BRN*','@南风#BRN*','@客风#BRN*','@红中#BRN*','@白板#BRN*','@春#BRN*','@夏#BRN*','@秋#BRN*','@冬#BRN*','@梅#BRN*','@兰#BRN*','@竹#BRN*','@菊#BRN*','@1万#BRN*','@2万#BRN*','@3万#BRN*','@4万#BRN*','@5万#BRN*','@6万#BRN*','@7万#BRN*','@8万#BRN*','@9万#BRN*','@1条#BRN*','@2筒#BRN*','@3筒#BRN*','@4筒#BRN*','@5筒#BRN*','@6筒#BRN*','@7筒#BRN*','@8筒#BRN*','@9筒#BRN*','@1筒#BRN*','@2条#BRN*','@3条#BRN*','@4条#BRN*','@5条#BRN*','@6条#BRN*','@7条#BRN*','@8条#BRN*','@9条#BRN*']
dat = ['@老麻将#DAT*','@大番#DAT*','@小番#DAT*','@后#DAT*','@骰子#DAT*','@牵#DAT*','@三牵#DAT*','@七牵#DAT*','@十一牵#DAT*','@顺#DAT*','@二顺#DAT*','@六顺#DAT*','@十顺#DAT*','@十顺#DAT*','@八后#DAT*','@十二后#DAT*','@猜牌#DAT*','@花色#DAT*','@线#DAT*','@五搭要素#DAT*','@六搭要素#DAT*','@筋线#DAT*','@一条线#DAT*','@三拖四#DAT*','@三拖一#DAT*','@大番品#DAT*','@高番#DAT*','@低番品#DAT*','@中番#DAT*']


def repl_apf(matchobj):
    return choice(apf)
  


def repl_mjs(matchobj):
    return choice(mjs)


def repl_num(matchobj):
    return choice(num)


def repl_per(matchobj):
    print(str(matchobj.group()))
    return choice(per)


def repl_stw(matchobj):
    return choice(stw)

  
def repl_brt(matchobj):
    return choice(brt)

def repl_brn(matchobj):
    return choice(brn)

def repl_dat(matchobj):
    return choice(dat)


def open_file(file_path):
    global s
    global dat_r

    f1 = open(file_path, 'r')
    s = f1.read()
    apf_r = re.sub('[@][^@]*?#APF\*', repl_apf, s)
    mjs_r = re.sub('[@][^@]*?#MJS\*', repl_mjs, apf_r)
    num_r = re.sub('[@][^@]*?#NUM\*', repl_num, mjs_r)
    per_r = re.sub('[@][^@]*?#PER\*', repl_per, num_r)
    stw_r = re.sub('[@][^@]*?#STW\*', repl_stw, per_r)
    brt_r = re.sub('[@][^@]*?#BRT\*', repl_brt, stw_r)
    brn_r = re.sub('[@][^@]*?#BRN\*', repl_brn, brt_r)
    dat_r = re.sub('[@][^@]*?#DAT\*', repl_dat, brn_r)
 
def save_file(save_path):
    f = open(save_path,'w')
    f.write(dat_r)
    f.close()    



if (__name__ == '__main__'):
    file_path = '/home/zelda/Documents/NER DOCUMENT/new1.txt.ann'
    open_file(file_path)
    save_file('out.ann')










